In [1]:
import sqlhelpers as sh

In [2]:
# %load Exercise Files\\Chapters\\sql-chap04.txt
-- 02 JOIN
-- test.db

-- join example tables, left and right
CREATE TABLE left ( id INTEGER, description TEXT );
CREATE TABLE right ( id INTEGER, description TEXT );

INSERT INTO left VALUES ( 1, 'left 01' );
INSERT INTO left VALUES ( 2, 'left 02' );
INSERT INTO left VALUES ( 3, 'left 03' );
INSERT INTO left VALUES ( 4, 'left 04' );
INSERT INTO left VALUES ( 5, 'left 05' );
INSERT INTO left VALUES ( 6, 'left 06' );
INSERT INTO left VALUES ( 7, 'left 07' );
INSERT INTO left VALUES ( 8, 'left 08' );
INSERT INTO left VALUES ( 9, 'left 09' );

INSERT INTO right VALUES ( 6, 'right 06' );
INSERT INTO right VALUES ( 7, 'right 07' );
INSERT INTO right VALUES ( 8, 'right 08' );
INSERT INTO right VALUES ( 9, 'right 09' );
INSERT INTO right VALUES ( 10, 'right 10' );
INSERT INTO right VALUES ( 11, 'right 11' );
INSERT INTO right VALUES ( 11, 'right 12' );
INSERT INTO right VALUES ( 11, 'right 13' );
INSERT INTO right VALUES ( 11, 'right 14' );

SELECT * FROM left;
SELECT * FROM right;

SELECT l.description AS left, r.description AS right
  FROM left AS l
  JOIN right AS r ON l.id = r.id
  ;

-- restore database
DROP TABLE left;
DROP TABLE right;

-- sale example
SELECT * FROM sale;
SELECT * FROM item;

SELECT s.id AS sale, i.name, s.price 
  FROM sale AS s
  JOIN item AS i ON s.item_id = i.id
  ;

SELECT s.id AS sale, s.date, i.name, i.description, s.price 
  FROM sale AS s
  JOIN item AS i ON s.item_id = i.id
  ;

-- 03 Junction Table
-- test.db

SELECT * FROM customer;
SELECT * FROM item;
SELECT * FROM sale;

SELECT i.name AS Item, c.name AS Cust, s.price AS Price
  FROM sale AS s
  JOIN item AS i ON s.item_id = i.id
  JOIN customer AS c ON s.customer_id = c.id
  ORDER BY Cust, Item
;

-- a customer without sales
INSERT INTO customer ( name ) VALUES ( 'Jane Smith' );
SELECT * FROM customer;

-- left joins
SELECT c.name AS Cust, c.zip, i.name AS Item, i.description, s.quantity AS Quan, s.price AS Price
  FROM customer AS c
  LEFT JOIN sale AS s ON s.customer_id = c.id
  LEFT JOIN item AS i ON s.item_id = i.id
  ORDER BY Cust, Item
;

-- restore database
DELETE FROM customer WHERE id = 4;

# Accessing related tables

In [4]:
# make test tables for joining

q1 = "CREATE TABLE left ( id INTEGER, description TEXT );"
q2 = "CREATE TABLE right ( id INTEGER, description TEXT );"

q3 = "INSERT INTO left VALUES ( 1, 'left 01' );"
q4 = "INSERT INTO left VALUES ( 2, 'left 02' );"
q5 = "INSERT INTO left VALUES ( 3, 'left 03' );"
q6 = "INSERT INTO left VALUES ( 4, 'left 04' );"
q7 = "INSERT INTO left VALUES ( 5, 'left 05' );"
q8 = "INSERT INTO left VALUES ( 6, 'left 06' );"
q9 = "INSERT INTO left VALUES ( 7, 'left 07' );"
q10 = "INSERT INTO left VALUES ( 8, 'left 08' );"
q11 = "INSERT INTO left VALUES ( 9, 'left 09' );"

q12 = "INSERT INTO right VALUES ( 6, 'right 06' );"
q13 = "INSERT INTO right VALUES ( 7, 'right 07' );"
q14 = "INSERT INTO right VALUES ( 8, 'right 08' );"
q15 = "INSERT INTO right VALUES ( 9, 'right 09' );"
q16 = "INSERT INTO right VALUES ( 10, 'right 10' );"
q17 = "INSERT INTO right VALUES ( 11, 'right 11' );"
q18 = "INSERT INTO right VALUES ( 11, 'right 12' );"
q19 = "INSERT INTO right VALUES ( 11, 'right 13' );"
q20 = "INSERT INTO right VALUES ( 11, 'right 14' );"

query_list = [q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, 
              q11, q12, q13, q14, q15, q16, q17, q18, q18, q19, q20]

for query in query_list:
    sh.perform_insert_and_stats(query, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| CREATE TABLE left ( id INTEGER, description TEXT ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| CREATE TABLE right ( id INTEGER, description TEXT ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO left VALUES ( 1, 'left 01' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO left VALUES ( 2, 'left 02' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO left VALUES ( 3, 'left 03' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO left VALUES ( 4, 'left 04' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO left VALUES ( 5, 'left 05' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO left VALUES ( 6, 'left 06' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO left VALUES ( 7, 'left 07' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO left VALUES ( 8, 'left 08' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO left VALUES ( 9, 'left 09' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO right VALUES ( 6, 'right 06' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO right VALUES ( 7, 'right 07' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO right VALUES ( 8, 'right 08' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO right VALUES ( 9, 'right 09' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO right VALUES ( 10, 'right 10' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO right VALUES ( 11, 'right 11' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO right VALUES ( 11, 'right 12' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO right VALUES ( 11, 'right 12' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO right VALUES ( 11, 'right 13' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO right VALUES ( 11, 'right 14' ); |||

In [5]:
q = "SELECT * FROM left;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM left; |||

There are 9 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
   id description
0   1     left 01
1   2     left 02
2   3     left 03
3   4     left 04
4   5     left 05

In [6]:
q = "SELECT * FROM right;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM right; |||

There are 10 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
   id description
0   6    right 06
1   7    right 07
2   8    right 08
3   9    right 09
4  10    right 10

In [7]:
# perform a join
q = '''
SELECT l.description AS left, r.description AS right
  FROM left AS l
  JOIN right AS r ON l.id = r.id
  ;
'''
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: |||
SELECT l.description AS left, r.description AS right
  FROM left AS l
  JOIN right AS r ON l.id = r.id
  ;
 |||

There are 4 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
      left     right
0  left 06  right 06
1  left 07  right 07
2  left 08  right 08
3  left 09  right 09

In [8]:
# delete the newly created tables

q1 = "DROP TABLE left;"
q2 = "DROP TABLE right;"

sh.perform_insert_and_stats(q1, 'test.db')
sh.perform_insert_and_stats(q2, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| DROP TABLE left; |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| DROP TABLE right; |||

In [9]:
# inspect tables to be used in next join exercise

q1 = "SELECT * FROM sale;"
q2 = "SELECT * FROM item;"

sh.query_result_stats(q1, "test.db")
sh.query_result_stats(q2, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM sale; |||

There are 5 rows in the query results table
There are 6 columns in the query results table

First 5 rows of the query results:
   id  item_id  customer_id        date  quantity  price
0   1        1            2  2009-02-27         3   2995
1   2        2            2  2009-02-27         1   1995
2   3        1            1  2009-02-28         1   2995
3   4        4            3  2009-02-28         2    999
4   5        1            2  2009-02-28         1   2995
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM item; |||

There are 4 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
   id              name                                  description
0   1  Box of 64 Pixels            64 RGB pixels in a decorative box
1   2    Sense of Humor       Especially dry. Imported from England.
2   3            Beauty  Inner beauty. No cosmetic surgery required!
3   4          Bar Code               Unused. In original packaging.

In [10]:
q = """
SELECT s.id AS sale, s.date, i.name, i.description, s.price 
  FROM sale AS s
  JOIN item AS i ON s.item_id = i.id
  ;
"""
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: |||
SELECT s.id AS sale, s.date, i.name, i.description, s.price
  FROM sale AS s
  JOIN item AS i ON s.item_id = i.id
  ;
 |||

There are 5 rows in the query results table
There are 5 columns in the query results table

First 5 rows of the query results:
   sale        date              name                             description  \
0     1  2009-02-27  Box of 64 Pixels       64 RGB pixels in a decorative box
1     2  2009-02-27    Sense of Humor  Especially dry. Imported from England.
2     3  2009-02-28  Box of 64 Pixels       64 RGB pixels in a decorative box
3     4  2009-02-28          Bar Code          Unused. In original packaging.
4     5  2009-02-28  Box of 64 Pixels       64 RGB pixels in a decorative box

   price
0   2995
1   1995
2   2995
3    999
4   2995

# Relating multiple tables

In [11]:
# inspect the tables we will be using

q1 = "SELECT * FROM customer;"
q2 = "SELECT * FROM item;"
q3 = "SELECT * FROM sale;"

sh.query_result_stats(q1, "test.db")
sh.query_result_stats(q2, "test.db")
sh.query_result_stats(q3, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM customer; |||

There are 4 rows in the query results table
There are 6 columns in the query results table

First 5 rows of the query results:
   id          name            address     city state    zip
0   1    Bill Smith    123 Main Street     Hope    CA  98765
1   2    Mary Smith  123 Dorian Street  Harmony    AZ  98765
2   3     Bob Smith   123 Laugh Street    Humor    CA  98765
3   5  Jimi Hendrix               None   Renton    WA   None
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM item; |||

There are 4 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
   id              name                                  description
0   1  Box of 64 Pixels            64 RGB pixels in a decorative box
1   2    Sense of Humor       Especially dry. Imported from England.
2   3            Beauty  Inner beauty. No cosmetic surgery required!
3   4          Bar Code               Unused. In original packaging.
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM sale; |||

There are 5 rows in the query results table
There are 6 columns in the query results table

First 5 rows of the query results:
   id  item_id  customer_id        date  quantity  price
0   1        1            2  2009-02-27         3   2995
1   2        2            2  2009-02-27         1   1995
2   3        1            1  2009-02-28         1   2995
3   4        4            3  2009-02-28         2    999
4   5        1            2  2009-02-28         1   2995

In [12]:
# a join query combining all 3 tables
q = """
SELECT i.name AS Item, c.name AS Cust, s.price AS Price
  FROM sale AS s
  JOIN item AS i ON s.item_id = i.id
  JOIN customer AS c ON s.customer_id = c.id
  ORDER BY Cust, Item
"""

sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: |||
SELECT i.name AS Item, c.name AS Cust, s.price AS Price
  FROM sale AS s
  JOIN item AS i ON s.item_id = i.id
  JOIN customer AS c ON s.customer_id = c.id
  ORDER BY Cust, Item
 |||

There are 5 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
               Item        Cust  Price
0  Box of 64 Pixels  Bill Smith   2995
1          Bar Code   Bob Smith    999
2  Box of 64 Pixels  Mary Smith   2995
3  Box of 64 Pixels  Mary Smith   2995
4    Sense of Humor  Mary Smith   1995